InformationRegisters/ИА_РаспределениеНедель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_РаспределениеНедель</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецНедели</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПереходнаяНеделя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_РаспределениеНедель/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(ДатаНачала, ДатаКонца, ИА_НачалоНедели,ИА_ОбрезатьНеделюВКонцеМесяца)
	ОбрезатьНедели = ИА_ОбрезатьНеделюВКонцеМесяца;
	НачалоНедели = ИА_НачалоНедели;
	
	Если НачалоНедели > 1 Тогда
		ДатаНачала1 = НачалоНедели(ДатаНачала) + (НачалоНедели-1)*60*60*24;
	Иначе
		ДатаНачала1 = НачалоНедели(ДатаНачала);
	КонецЕсли;
	
	// стираем старые записи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Период МЕЖДУ &ДатаНачала И &ДатаКонца"; 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала1);
	Запрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Мен = РегистрыСведений.ИА_РаспределениеНедель.СоздатьМенеджерЗаписи();
		Мен.Период = Выборка.Период;
		Мен.Удалить();
	КонецЦикла;
	
	ТекДата = ДатаНачала1;
	Пока ТекДата<=ДатаКонца Цикл
		Мен = РегистрыСведений.ИА_РаспределениеНедель.СоздатьМенеджерЗаписи();
		Мен.Период = ТекДата;
		Мен.Месяц = НачалоМесяца(ТекДата);
		
		НачНедели = ТекДата;
		КонНедели = ТекДата + 60*60*24*6;
		
		Мен.КонецНедели = КонНедели;
		
		НачМес1 = НачалоМесяца(НачНедели);
		НачМес2 = НачалоМесяца(КонНедели);
		
		Если НачМес1 <> НачМес2 Тогда // переходная неделя
			Если ОбрезатьНедели Тогда
				времКН = Мен.КонецНедели;
				Мен.КонецНедели = КонецМесяца(НачНедели);
				Мен.Записать(истина);
				
				// добавим переходную неделю
				Мен = РегистрыСведений.ИА_РаспределениеНедель.СоздатьМенеджерЗаписи();
				Мен.Период = НачМес2;
				Мен.Месяц = НачалоМесяца(времКН);
				Мен.КонецНедели = времКН;
				Мен.ПереходнаяНеделя = истина;
			Иначе
				КолДнейДо = (НачМес2 - ТекДата) / (60*60*24);
				Если КолДнейДо < 4 Тогда //неделю переносим в след месяц т.к. в нем больше дней из нее
					Мен.Месяц = ДобавитьМесяц(Мен.Месяц, 1);	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Мен.Записать(истина);
		
		ТекДата = ТекДата + 60*60*24*7;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ОткрытьФорму("РегистрСведений.ИА_РаспределениеНедель.Форма.ФормаВыбораПериода",,,,,, Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершениеЗавершение", ЭтотОбъект, Новый Структура("Результат", Результат)), "Если существуют записи в указанном диапазоне, они будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершениеЗавершение(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	
	Результат = ДополнительныеПараметры1.Результат;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да ТОгда
		ЗаполнитьНаСервере(Результат.ДатаНачала, Результат.ДатаКонца, Результат.ИА_НачалоНедели,Результат.ИА_ОбрезатьНеделюВКонцеМесяца);
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	тд = Элементы.Список.ТекущиеДанные;
	тд.Месяц = НачалоМесяца(тд.Месяц);
КонецПроцедуры
